{
  "backend/main.mo": "Actor implementing access-controlled user profiles and contact message storage with admin-restricted retrieval.",
  "feature_evidence.json": "Feature evidence report mapping implemented UI/UX features to source files and component dependencies.",
  "frontend-file-summaries.txt": "Lookup file providing short descriptions of all frontend components, sections, hooks, and shared utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining brand color variables, theming tokens, and global background/foreground styles.",
  "frontend/index.html": "HTML entry template setting metadata, fonts, and mounting point for the React application.",
  "frontend/src/App.tsx": "Main React component composing all site sections within the SiteLayout wrapper.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, input fields, and backend submission using React Query.",
  "frontend/src/components/contact/DevSubmissionsPanel.tsx": "Development-only panel that fetches and displays all contact form submissions for admin testing.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with brand info, quick links, social icons, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Navbar.tsx": "Implements a responsive navbar with scroll-to-section navigation, mobile drawer menu, and brand logo.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site structure with navbar, footer, skip link, and main content slot.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, description, grade/weight tags, and an enquiry button opening WhatsApp.",
  "frontend/src/components/sections/AboutSection.tsx": "Shows the About section with headings and descriptive text about sourcing and quality.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides contact info, WhatsApp order button, optional dev panel, and an embedded Google Map.",
  "frontend/src/components/sections/HomeSection.tsx": "Hero section with background image, CTA buttons, and feature icons highlighting key product qualities.",
  "frontend/src/components/sections/index.ts": "Re-exports all section components for simplified imports.",
  "frontend/src/components/sections/ProductsSection.tsx": "Lists premium products using ProductCard components with reveal animations.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Renders customer testimonials with star ratings in card layout.",
  "frontend/src/components/sections/WhyChooseSection.tsx": "Renders a branded 'Why Choose' section with animated reveal effects and a grid of reasons using icon components.",
  "frontend/src/components/shared/BrandButton.tsx": "Provides a styled button component with brand-specific variants and utility-based styling.",
  "frontend/src/components/shared/BrandCard.tsx": "Wraps content in a styled card with optional hover effects and brand theme classes.",
  "frontend/src/components/shared/Reveal.tsx": "Animates children into view using an intersection observer hook with optional delay.",
  "frontend/src/components/shared/Section.tsx": "Defines a section wrapper with spacing and container layout classes.",
  "frontend/src/components/shared/SkipToContent.tsx": "Provides an accessible skip link for keyboard users to jump to main content.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of a backend actor based on Internet Identity, auto-refreshing dependent queries.",
  "frontend/src/hooks/useContactSubmissions.ts": "Provides hooks for submitting and fetching contact messages via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizing feature-specific queries.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Detects when an element enters the viewport using IntersectionObserver to trigger reveal animations.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines the application's brand color system using CSS variables.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with query and identity providers and loading global styles.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls to a section by ID while compensating for sticky navbar height.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, and clearing URL and session-based parameters, including hash support.",
  "frontend/src/utils/whatsapp.ts": "Provides a helper that opens WhatsApp with a prefilled message based on enquiry context.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, brand colors, container settings, animations, and plugin usage.",
  "project_state.json": "Tracks project state, goals, required images, features, and architectural notes for the Spice Lux website build."
}